**데이터프레임 생성**

In [1]:

MembersN <- c ('Mika','Josep','Kadar','Messi')
metallicaAges <- c (27,45,31,46)

NameError: name 'Members' is not defined

In [15]:
metallica <- data.frame(Name = metallicaNames, Age = metallicaAges)

In [16]:
metallica

  Name  Age
1 Lars  47
2 James 47
3 Kirk  48
4 Rob   46

In [17]:
metallica$childAge <- c(12,11,13,23)

In [18]:
metallica

  Name  Age childAge
1 Lars  47  12
2 James 47  11
3 Kirk  48  13
4 Rob   46  23

In [2]:
import pandas as pd

metallica_Names = ['Lars','James','Kirk','Rob']
metallica_Ages = [47,47,48,46]

In [17]:
metallica = pd.DataFrame({'Name' : metallica_Names,'Age' : metallica_Ages})

In [18]:
metallica

    Name  Age
0   Lars   47
1  James   47
2   Kirk   48
3    Rob   46